tutorials/cfdemSolverMultiphase/small_scale_hearth_drainage/init/CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    atmosphere
    {
        type            patch;
        nFaces          160;
        startFace       2624;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          351;
        startFace       2784;
    }
    outlet
    {
        type            patch;
        nFaces          1;
        startFace       3135;
    }
)

// ************************************************************************* //
