tutorials/cfdemSolverMultiphase/small_scale_hearth_drainage/init/CFD/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    atmosphere
    {
        type        pressureInletOutletVelocity;
        value       uniform (0 0 0);
    }

    outlet
    {
		type		fixedValue;
		value 		uniform (0 0 0);
   }
    walls
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
}


// ************************************************************************* //
